---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExtensibleStorage.Field
source: html/94b2c52d-8141-1c16-3b8b-b66affa4e81e.htm
---
# Field Methods

Checks if the specified unit is compatible with the field description.